#Data Frame

##Data Frame Creation

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "Name": ['Alice', 'Bob', 'Charlie', 'Sowmik'],
    "Age": [25, 30, 35, 27],
    "City": ['New York', 'Los Angeles', 'Chicago', 'Chittagong']
}        #Creating a dictionary

In [4]:
df = pd.DataFrame(dict1) #Making it a pandas dataframe
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3   Sowmik   27   Chittagong

##Exporting Data Frame as .csv file

In [5]:
df.to_csv("friends.csv")  #Exporting as a csv file

In [ ]:
from google.colab import files  #Downloading the csv file into local machine
files.download("/content/friends.csv")

In [ ]:
from google.colab import drive  #Mounting the csv file into google drive
drive.mount('/content/drive')
df.to_csv("/content/drive/My Drive/friends.csv", index=False)

##Data Frame related Functions

In [ ]:
df.head(2) #Displays the first 2 rows of the dataframe

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [ ]:
df.tail(2) #Displays the last 2 rows of the dataframe

      Name  Age        City
2  Charlie   35     Chicago
3   Sowmik   27  Chittagong

In [ ]:
df.describe() #Displays the statistical summary of the dataframe

             Age
count   4.000000
mean   29.250000
std     4.349329
min    25.000000
25%    26.500000
50%    28.500000
75%    31.250000
max    35.000000

In [9]:
df ['Age'][1]=50 #changing particular value in a particular row and column

C:\Users\USER\AppData\Local\Temp\ipykernel_2600\872349008.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df ['Age'][1]=50 #changing particular value in a particular row and column
C:\Users\USER\AppData\Local\Temp\ipykernel_2600\872349008.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df ['Age'][1]=50 #changing particular value in a particular row and column

In [8]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   50  Los Angeles
2  Charlie   35      Chicago
3   Sowmik   27   Chittagong

In [10]:
df.index=['a','b','c','d'] #Changing the index of the dataframe
df

      Name  Age         City
a    Alice   25     New York
b      Bob   50  Los Angeles
c  Charlie   35      Chicago
d   Sowmik   27   Chittagong

##Uploading a .csv file into google colab and VS Code

In [ ]:
from google.colab import files #manually from local machine into google colab
uploaded = files.upload()

In [ ]:
df1 = pd.read_csv("Exercise_05_008.csv")
df1

In [ ]:
df2 = pd.read_csv("C:/Users/USER/Downloads/rebuilt_tasks.csv") #from local machine to VS code
df2

,Activity,Duration (days),Start Date,End Date,Date Error,Task Name
0,Commencing of the project,1 day,2025-01-26 18:40:11.862990,2025-01-27 18:40:11.862990,False,0 - Commencing of the project
1,Signing of the Agreement,1.0 days,2025-07-01 00:00:00.000000,2025-07-01 00:00:00.000000,False,0 - Signing of the Agreement
2,Scheduling of the Project,70.0 days,2025-07-02 00:00:00.000000,2025-09-09 00:00:00.000000,False,0 - Scheduling of the Project
3,"Mobilization of Resources, Office Setup and pr...",30.0 days,2025-09-10 00:00:00.000000,2025-10-09 00:00:00.000000,False,"0 - Mobilization of Resources, Office Setup an..."
4,Formation of Project Steering Committee,25.0 days,2025-10-10 00:00:00.000000,2025-11-03 00:00:00.000000,False,0 - Formation of Project Steering Committee
...,...,...,...,...,...,...
73,Environmental and social impact assessment,110.0 days,2033-08-23 00:00:00.000000,2033-12-12 00:00:00.000000,False,6 - Environmental and social impact assessment
74,Cost-benefit and efficiency evaluation,140.0 days,2033-12-13 00:00:00.000000,2034-04-30 00:00:00.000000,False,6 - Cost-benefit and efficiency evaluation
75,Reporting,1 day,2025-01-26 18:40:11.862990,2025-01-27 18:40:11.862990,False,6 - Reporting
76,Draft final report preparation,1 day,2034-05-01 00:00:00.000000,2034-10-30 00:00:00.000000,False,6 - Draft final report preparation
77,Final report preparation and submission,1 day,2034-11-01 00:00:00.000000,2035-06-30 00:00:00.000000,False,6 - Final report preparation and submission

##Some more dataframe functions and operations for data science and machine learning

In [11]:
newdf = pd.DataFrame(np.random.rand(334,5) , index=np.arange(334))
newdf

            0         1         2         3         4
0    0.587288  0.008436  0.926661  0.005508  0.633554
1    0.223982  0.990790  0.959817  0.419890  0.859373
2    0.515029  0.428883  0.830666  0.252036  0.573971
3    0.084094  0.852253  0.505533  0.551721  0.791230
4    0.751132  0.499464  0.875741  0.814145  0.768285
..        ...       ...       ...       ...       ...
329  0.807566  0.909824  0.638319  0.599144  0.268318
330  0.316067  0.584395  0.290389  0.429426  0.583941
331  0.903247  0.737886  0.784007  0.314201  0.214757
332  0.800724  0.836779  0.704038  0.429941  0.491905
333  0.971494  0.126191  0.934645  0.141159  0.994657

[334 rows x 5 columns]

In [12]:
type(newdf)

pandas.core.frame.DataFrame

In [13]:
newdf.to_numpy() #Converting dataframe to numpy array

array([[0.58728819, 0.00843611, 0.92666148, 0.00550849, 0.63355419],
       [0.2239817 , 0.99078989, 0.9598169 , 0.41988984, 0.8593727 ],
       [0.51502899, 0.42888349, 0.83066615, 0.25203578, 0.57397088],
       ...,
       [0.90324665, 0.73788588, 0.78400653, 0.31420118, 0.21475743],
       [0.80072408, 0.83677941, 0.70403753, 0.4299415 , 0.49190509],
       [0.97149354, 0.12619073, 0.93464474, 0.14115874, 0.99465671]])

In [14]:
newdf.T # Transpose of the DataFrame

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.587288,0.223982,0.515029,0.084094,0.751132,0.763577,0.029305,0.445522,0.093240,0.802941,...,0.399277,0.637226,0.212114,0.338560,0.482148,0.807566,0.316067,0.903247,0.800724,0.971494
1,0.008436,0.990790,0.428883,0.852253,0.499464,0.935871,0.088964,0.337372,0.939035,0.622180,...,0.965555,0.038630,0.826149,0.579185,0.015916,0.909824,0.584395,0.737886,0.836779,0.126191
2,0.926661,0.959817,0.830666,0.505533,0.875741,0.737094,0.903788,0.390351,0.709734,0.449149,...,0.739654,0.473675,0.763899,0.347929,0.568035,0.638319,0.290389,0.784007,0.704038,0.934645
3,0.005508,0.419890,0.252036,0.551721,0.814145,0.865564,0.191702,0.419214,0.369170,0.459072,...,0.830083,0.422727,0.359234,0.232261,0.154256,0.599144,0.429426,0.314201,0.429941,0.141159
4,0.633554,0.859373,0.573971,0.791230,0.768285,0.178117,0.667815,0.809139,0.459154,0.163819,...,0.344117,0.183321,0.970364,0.451145,0.029852,0.268318,0.583941,0.214757,0.491905,0.994657

In [15]:
newdf.sort_index(axis=0, ascending=False) #Sorting dataframe in descending way row wise

            0         1         2         3         4
333  0.971494  0.126191  0.934645  0.141159  0.994657
332  0.800724  0.836779  0.704038  0.429941  0.491905
331  0.903247  0.737886  0.784007  0.314201  0.214757
330  0.316067  0.584395  0.290389  0.429426  0.583941
329  0.807566  0.909824  0.638319  0.599144  0.268318
..        ...       ...       ...       ...       ...
4    0.751132  0.499464  0.875741  0.814145  0.768285
3    0.084094  0.852253  0.505533  0.551721  0.791230
2    0.515029  0.428883  0.830666  0.252036  0.573971
1    0.223982  0.990790  0.959817  0.419890  0.859373
0    0.587288  0.008436  0.926661  0.005508  0.633554

[334 rows x 5 columns]

In [21]:
newdf.columns = list("ABCDE") #Changing column headers
newdf

            A         B         C         D         E
0    0.587288  0.008436  0.926661  0.005508  0.633554
1    0.223982  0.990790  0.959817  0.419890  0.859373
2    0.515029  0.428883  0.830666  0.252036  0.573971
3    0.084094  0.852253  0.505533  0.551721  0.791230
4    0.751132  0.499464  0.875741  0.814145  0.768285
..        ...       ...       ...       ...       ...
329  0.807566  0.909824  0.638319  0.599144  0.268318
330  0.316067  0.584395  0.290389  0.429426  0.583941
331  0.903247  0.737886  0.784007  0.314201  0.214757
332  0.800724  0.836779  0.704038  0.429941  0.491905
333  0.971494  0.126191  0.934645  0.141159  0.994657

[334 rows x 5 columns]

In [17]:
newdf.drop('E', axis=1) #Dropping a column from dataframe

            A         B         C         D
0    0.587288  0.008436  0.926661  0.005508
1    0.223982  0.990790  0.959817  0.419890
2    0.515029  0.428883  0.830666  0.252036
3    0.084094  0.852253  0.505533  0.551721
4    0.751132  0.499464  0.875741  0.814145
..        ...       ...       ...       ...
329  0.807566  0.909824  0.638319  0.599144
330  0.316067  0.584395  0.290389  0.429426
331  0.903247  0.737886  0.784007  0.314201
332  0.800724  0.836779  0.704038  0.429941
333  0.971494  0.126191  0.934645  0.141159

[334 rows x 4 columns]

In [18]:
newdf.loc[[1,2], ['C', 'D']] #accessing particular datas

          C         D
1  0.959817  0.419890
2  0.830666  0.252036

In [19]:
newdf.iloc[0, 2] #only counting from indeces

0.9266614766063571

In [20]:
newdf.loc[(newdf['B']<0.5) & (newdf['A']<0.1)] #complex query

            A         B         C         D         E
6    0.029305  0.088964  0.903788  0.191702  0.667815
16   0.055519  0.447489  0.858428  0.187638  0.080079
20   0.062615  0.454702  0.080020  0.992897  0.313573
48   0.083543  0.005936  0.411985  0.566474  0.873583
72   0.027016  0.383361  0.318659  0.163085  0.313210
86   0.077339  0.217012  0.709607  0.873699  0.069393
113  0.071938  0.079001  0.797505  0.805324  0.131613
140  0.029209  0.097475  0.711443  0.429524  0.494218
154  0.086990  0.157623  0.479643  0.110394  0.650536
195  0.050666  0.186422  0.002305  0.180164  0.401435
197  0.015192  0.129498  0.930753  0.990840  0.680354
219  0.028173  0.108246  0.873706  0.831589  0.391962
238  0.059645  0.402190  0.588353  0.504398  0.817243
304  0.078491  0.300727  0.362559  0.417356  0.263255

In [25]:
iris = pd.read_csv("C:/Users/USER/Downloads/8836201-6f9306ad21398ea43cba4f7d537619d0e07d5ae3/8836201-6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [27]:
iris.info() #Different information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [29]:
iris2 = pd.read_csv("C:/Users/USER/Downloads/8836201-6f9306ad21398ea43cba4f7d537619d0e07d5ae3/8836201-6f9306ad21398ea43cba4f7d537619d0e07d5ae3/Iris 2.0.csv")
iris2

     sepal.length  sepal.width  petal.length  petal.width    variety
0             NaN          3.5           1.4          0.2     Setosa
1             4.9          3.0           NaN          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          NaN           1.5          0.2        NaN
4             5.0          3.6           1.4          NaN     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [31]:
iris2.dropna() #Dropping all the rows containing nan values or missing values

     sepal.length  sepal.width  petal.length  petal.width    variety
2             4.7          3.2           1.3          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
6             4.6          3.4           1.4          0.3     Setosa
8             4.4          2.9           1.4          0.2     Setosa
10            5.4          3.7           1.5          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[142 rows x 5 columns]

In [42]:
iris2.fillna(0, inplace=True) #Filling up all the missing values with 0

In [43]:
iris2.rename(columns={"sepal.length": "SL"}, inplace=True) #Changing column names in the original df with inplace 
iris2

      SL  sepal.width  petal.length  petal.width    variety
0    0.0          3.5           1.4          0.2     Setosa
1    4.9          3.0           0.0          0.2     Setosa
2    4.7          3.2           1.3          0.2     Setosa
3    4.6          0.0           1.5          0.2          0
4    5.0          3.6           1.4          0.0     Setosa
..   ...          ...           ...          ...        ...
145  6.7          3.0           5.2          2.3  Virginica
146  6.3          2.5           5.0          1.9  Virginica
147  6.5          3.0           5.2          2.0  Virginica
148  6.2          3.4           5.4          2.3  Virginica
149  5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [44]:
iris2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SL            150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [46]:
iris2['SL'] = iris2["SL"].astype(int) #Changing the data type of a column
iris2

     SL  sepal.width  petal.length  petal.width    variety
0     0          3.5           1.4          0.2     Setosa
1     4          3.0           0.0          0.2     Setosa
2     4          3.2           1.3          0.2     Setosa
3     4          0.0           1.5          0.2          0
4     5          3.6           1.4          0.0     Setosa
..   ..          ...           ...          ...        ...
145   6          3.0           5.2          2.3  Virginica
146   6          2.5           5.0          1.9  Virginica
147   6          3.0           5.2          2.0  Virginica
148   6          3.4           5.4          2.3  Virginica
149   5          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [47]:
iris2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SL            150 non-null    int32
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(3), int32(1), object(1)
memory usage: 5.4+ KB

In [49]:
iris2["zeroes"] = [0 for i in range (len(iris2))] #Creating a new column
iris2

     SL  sepal.width  petal.length  petal.width    variety  zeroes
0     0          3.5           1.4          0.2     Setosa       0
1     4          3.0           0.0          0.2     Setosa       0
2     4          3.2           1.3          0.2     Setosa       0
3     4          0.0           1.5          0.2          0       0
4     5          3.6           1.4          0.0     Setosa       0
..   ..          ...           ...          ...        ...     ...
145   6          3.0           5.2          2.3  Virginica       0
146   6          2.5           5.0          1.9  Virginica       0
147   6          3.0           5.2          2.0  Virginica       0
148   6          3.4           5.4          2.3  Virginica       0
149   5          3.0           5.1          1.8  Virginica       0

[150 rows x 6 columns]

In [52]:
iris2["SL Sq"] = iris2["SL"]*iris2["SL"]
iris2

     SL  sepal.width  petal.length  petal.width    variety  zeroes  SL Sq
0     0          3.5           1.4          0.2     Setosa       0      0
1     4          3.0           0.0          0.2     Setosa       0     16
2     4          3.2           1.3          0.2     Setosa       0     16
3     4          0.0           1.5          0.2          0       0     16
4     5          3.6           1.4          0.0     Setosa       0     25
..   ..          ...           ...          ...        ...     ...    ...
145   6          3.0           5.2          2.3  Virginica       0     36
146   6          2.5           5.0          1.9  Virginica       0     36
147   6          3.0           5.2          2.0  Virginica       0     36
148   6          3.4           5.4          2.3  Virginica       0     36
149   5          3.0           5.1          1.8  Virginica       0     25

[150 rows x 7 columns]

In [57]:
iris2.to_csv("new_iris.csv", index=False)

In [60]:
pd.concat([iris, iris2]) #Merging two dataframes

,sepal.length,sepal.width,petal.length,petal.width,variety,SL,zeroes,SL Sq
0,5.1,3.5,1.4,0.2,Setosa,NaN,NaN,NaN
1,4.9,3.0,1.4,0.2,Setosa,NaN,NaN,NaN
2,4.7,3.2,1.3,0.2,Setosa,NaN,NaN,NaN
3,4.6,3.1,1.5,0.2,Setosa,NaN,NaN,NaN
4,5.0,3.6,1.4,0.2,Setosa,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
145,NaN,3.0,5.2,2.3,Virginica,6.0,0.0,36.0
146,NaN,2.5,5.0,1.9,Virginica,6.0,0.0,36.0
147,NaN,3.0,5.2,2.0,Virginica,6.0,0.0,36.0
148,NaN,3.4,5.4,2.3,Virginica,6.0,0.0,36.0
149,NaN,3.0,5.1,1.8,Virginica,5.0,0.0,25.0